<template>
  <div class="ai-copy-wrap">
    <div class="title">数智网格员简介</div>
    <div>
      智能问答机器人系统旨在为数字城市建设提供了算法和模型的基础能力，可提供近丰富的城市场景算法和业务模型；同时提供了一套自动化的调度体系，撑业务与智能算法的精细融合和持续演进。平台能为各地的数字城市的建设中发挥重要的作用，为城市信息感知、城市业务协同、城市治理决策等业务提供了丰富而有效的大模型支撑。
      总体架构如下图所示：</div>

    <div>平台分为基础设施层、数据层、工具平台层、模型即服务层、智能应用层和用户触达层五个部分。</div>
    <div>1. 基础设施层
      基础设施包含硬件基础设施和软件基础设施两个部分。硬件基础设施，主要包括建基础设施（机房基建）、通用服务器、GPU服务器、以及全闪存储产品、混闪存储产品等；软件基础设施主要包括多云算力调度平台、异构AI算力适配平台、智能运营开放平台等内容；
    </div>
    <div>2. 语料层
      基于政务领域的法律法规、标准规范、相关政策文件、事项指南、事件清单和城市指标等数据和政务语料，从文件类型、发布机构、公开年份、文件主题、服务对象、特色分类等维度，建设分类分级、集中统一、动态更新的本地政策向量数据库，包括政务事项数据库、城市事件数据库、政务文档数据库和标准规范数据库等内容。采用高效的向量数据库技术，将相关语料转化为向量表示，存储在数据库中。向量数据库需要支持快速的相似度查询和关联推理，以便为大语言模型提供丰富的语料和数据支撑。
    </div>
    <div>3. 工具平台层
      工具平台层提供共性能力支撑，包括语料管理平台和模型生产平台，数据库服务系统将为全市打造统一的、标准化的、覆盖全的、良性互动的一体化语料服务生态平台，实现语料的统一采集、统一存储、统一管理、统一使用，将政府语料管理的全流程变得信息化、智能化、便捷化，不仅解决市民企业基本的办事需求，也促进政府内部语料不断更新、不断累积、分享互助的良性机制的建立。模型生产平台用于管理和维护城市中全场景的AI模型资产和模型服务。对城市治理应用提供模型的统一调度支撑。模型资产服务中心在沉淀AI智能资产的同时，可兼容第三方的AI模型和数据集，利用NLP、CV、KG等分析手段，构建涵盖政务服务、城市治理等场景的AI模型体系，形成可迭代、可优化的全场景智能资产。
    </div>
    <div>4. 模型即服务层
      基础大模型提供理解能力、推理能力和生成能力三大核心能力，能够对外提供向量生成、场景微调、数智机器人、提示词管理和上下文生成等服务。
      领域能力围绕政务垂直领域，提供指标调用能力、态势刻画能力、薄弱识别能力、异常溯源能力、城市治理对比能力、社会治理对比能力、定性分析能力、推演预测能力、指令归并能力、产业智能分析能力，通过插件管理功能与现有政务业务系统、数据仓库、数据库、指标库耦合，实现面向政务相关领域问题的理解、推理、分析、解答、创作能力，实现“感知-认知-决策-执行”的闭环，驱动城市高层智慧决策、中层精准施策、基层高效执行、公众个性服务的“端到端模式优化”，推动可成长型智慧政府的落地。
    </div>
    <div>5. 用户触达层
      这一层是系统的核心会使用预训练模型作为基础模型,然后通过微调来适应新的业务场景数据集，场景微调主要负责将基础智能处理层的能力与具体的业务场景相结合。用户触达层提供“小鲸”智慧决策助理、和“小鲸”智慧政务助手服务。
      用户触达层采用模块化和可插拔设计，可以根据不同的应用场景和需求灵活添加或删除业务模块。业务处理层主要负责将基础智能处理层的能力与具体的业务场景相结合，实现个性化的问答服务。</div>
  </div>
</template>

<script setup lang="ts">

</script>
<style lang="scss" scoped>
*{
  box-sizing: border-box;
  font-size: 14px;
}
.ai-copy-wrap {
  width: 100%;
  display: flex;
  flex-direction: column;
  height: auto;
  background-color: #F1FCFF;
  padding: 20px;
  gap: 20px;

  .txt {
    font-size: 16px;
    background: #ffffff;
    padding: 20px 30px;
    display: flex;
    justify-content: center;
    align-items: center;
    border-radius: 10px;
  }
  .title{
    text-align: center;
    font-size: 16px;
    font-weight: bold;
  }
}
</style>
